module bool where

----------------------------------------------------------------------
-- datatypes
----------------------------------------------------------------------

data 𝔹 : Set where
    true  : 𝔹
    false : 𝔹


{-# BUILTIN BOOL 𝔹 #-}
{-# BUILTIN TRUE true #-} 
{-# BUILTIN FALSE false #-}

----------------------------------------------------------------------
-- syntax
----------------------------------------------------------------------

infix   7 ¬_
--infixl  6 _xor_ _nand_ 
infixr  6 _&&_
infixr  5 _||_
--infix   4 if_then_else_ if*_then_else_
--infixr  4 _imp_

 
----------------------------------------------------------------------
-- operations
----------------------------------------------------------------------

¬_ : 𝔹 → 𝔹
¬ true  = false
¬ false = true

_&&_ : 𝔹 → 𝔹 → 𝔹
true  && b = b
false && b = false

_||_ : 𝔹 → 𝔹 → 𝔹
false || b = b
true  || b = true





